---
kind: type
id: T:Autodesk.Revit.DB.Plumbing.PipingSystem
source: html/6abbdfa2-69a5-eef1-2663-89a5faf91831.htm
---
# Autodesk.Revit.DB.Plumbing.PipingSystem

A piping system element.

## Syntax (C#)
```csharp
public class PipingSystem : MEPSystem
```